app/controllers/gossip_controller.rb

  def display_id
    @author = Gossip.where(id: params[:id]).first.author
    @content = Gossip.where(id: params[:id]).first.content
    @created_at = Gossip.where(id: params[:id]).first.created_at
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 ORDER BY "gossips"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]