app/controllers/welcome_controller.rb

  def first_name
  @first_name = params[:first_name]
  @gossips = Gossip.all
---
SELECT "gossips".* FROM "gossips"